dynamicMesh_Piston_1.1/system/blockMeshDict
/*-----------------------------------------------------*\
| ========= | |
| \ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \ / O peration | Version: 1.3 |
| \ / A nd | Web: http://www.openfoam.org |
| \/ M anipulation | |
\*-----------------------------------------------------*/

FoamFile
{
version 2.0;
format ascii;

root "";
case "";
instance "";
local "";

class dictionary;
object blockMeshDict;
}
needleRadius       0.5; //mm
needleRadiusNeg   -0.5; 
needleR     0.35355339059;       // = 0.5 mm/sqrt(2)  for the block point usage
needleRNeg  -0.35355339059;
nozzleR     0.0848528137423857;   // = 0.12 mm/sqrt(2)
nozzleRNeg  -0.0848528137423857;
exitR       0.04949747468305833;    // = 0.07/sqrt(2)
exitRNeg    -0.04949747468305833;
nDeg             8;
nPlate          18;
nHeight         31;  // Height = 1 mm
// * * * * * * * * * * * * * * * * * * * * * * * * * *//
//meshGenApp blockMesh;
convertToMeters 0.001;
vertices
(
( 0.0424264068711928   -0.0424264068711928  -0.2) //0
( 0.0424264068711928    0.0424264068711928  -0.2)
( -0.0424264068711928   0.0424264068711928  -0.2)
( -0.0424264068711928  -0.0424264068711928  -0.2)

( $nozzleR      $nozzleRNeg  -0.2) //4
( $nozzleR      $nozzleR     -0.2)
( $nozzleRNeg   $nozzleR     -0.2)
( $nozzleRNeg   $nozzleRNeg  -0.2)

( 0.0282842712474619 -0.0282842712474619  0) //8
( 0.0282842712474619 0.0282842712474619   0)
( -0.0282842712474619 0.0282842712474619  0)
( -0.0282842712474619 -0.0282842712474619 0)

( $exitR      $exitRNeg  0) //12
( $exitR      $exitR     0)
( $exitRNeg   $exitR     0)
( $exitRNeg   $exitRNeg  0)

( 0.5 -0.5 0) //16
( 0.5 0.5 0)
( -0.5 0.5 0)
( -0.5 -0.5 0)

( 0.0282842712474619 -0.0282842712474619  1.0) //20
( 0.0282842712474619 0.0282842712474619   1.0)
( -0.0282842712474619 0.0282842712474619  1.0)
( -0.0282842712474619 -0.0282842712474619 1.0)

( 0.04949747468305833  -0.04949747468305833   1.0) //24
( 0.04949747468305833   0.04949747468305833   1.0)
( -0.04949747468305833  0.04949747468305833   1.0)
( -0.04949747468305833 -0.04949747468305833   1.0)

( 0.5 -0.5 1.0) //28
( 0.5 0.5 1.0)
( -0.5 0.5 1.0)
( -0.5 -0.5 1.0)

( $needleR     $needleRNeg  -0.7) //32  r=0.48
( $needleR     $needleR     -0.7)
( $needleRNeg  $needleR     -0.7)
( $needleRNeg  $needleRNeg  -0.7)

( 0.4384062043   -0.4384062043  -0.7) //36  r=0.62
( 0.4384062043   0.4384062043   -0.7)
( -0.4384062043  0.4384062043   -0.7)
( -0.4384062043  -0.4384062043  -0.7)

( $needleR      $needleRNeg  -0.8) //40  r=0.48
( $needleR      $needleR     -0.8)
( $needleRNeg   $needleR     -0.8)
( $needleRNeg   $needleRNeg  -0.8)

( 0.50911688245    -0.50911688245  -0.8) //44  r=0.72
( 0.50911688245    0.50911688245   -0.8)
( -0.50911688245   0.50911688245   -0.8)
( -0.50911688245   -0.50911688245  -0.8)

);
blocks
(
hex (0 1 2 3 8 9 10 11) ($nDeg $nDeg 8) simpleGrading (1 1 0.69) //NOZZLE
hex (1 5 6 2 9 13 14 10) (5 $nDeg 8) simpleGrading (1 1 0.69)    //NOZZLE
hex (2 6 7 3 10 14 15 11) (5 $nDeg 8) simpleGrading (1 1 0.69)   //NOZZLE
hex (3 7 4 0 11 15 12 8) (5 $nDeg 8) simpleGrading (1 1 0.69)    //NOZZLE
hex (0 4 5 1 8 12 13 9) (5 $nDeg 8) simpleGrading (1 1 0.69)     //NOZZLE
hex (8 9 10 11 20 21 22 23) ($nDeg $nDeg $nHeight) simpleGrading (1 1 1)  //OPEN AREA
hex (9 13 14 10 21 25 26 22) (5 $nDeg $nHeight) simpleGrading (1 1 1)     //OPEN AREA
hex (10 14 15 11 22 26 27 23) (5 $nDeg $nHeight) simpleGrading (1 1 1)    //OPEN AREA
hex (11 15 12 8 23 27 24 20) (5 $nDeg $nHeight) simpleGrading (1 1 1)     //OPEN AREA
hex (8 12 13 9 20 24 25 21) (5 $nDeg $nHeight) simpleGrading (1 1 1)      //OPEN AREA

hex (18 14 13 17 30 26 25 29) ($nPlate $nDeg $nHeight) simpleGrading (0.105 1 1)
hex (19 15 14 18 31 27 26 30) ($nPlate $nDeg $nHeight) simpleGrading (0.105 1 1)
hex (16 12 15 19 28 24 27 31) ($nPlate $nDeg $nHeight) simpleGrading (0.105 1 1)
hex (17 13 12 16 29 25 24 28) ($nPlate $nDeg $nHeight) simpleGrading (0.105 1 1)

hex (32 33 34 35 0 1 2 3 ) ($nDeg $nDeg 7) simpleGrading (1 1 1)
hex (33 37 38 34 1 5 6 2 ) (5 $nDeg 7) simpleGrading (1 1 1)
hex (34 38 39 35 2 6 7 3 ) (5 $nDeg 7) simpleGrading (1 1 1)
hex (35 39 36 32 3 7 4 0 ) (5 $nDeg 7) simpleGrading (1 1 1)
hex (32 36 37 33 0 4 5 1 ) (5 $nDeg 7) simpleGrading (1 1 1)

//hex (40 41 42 43 32 33 34 35) ($nDeg $nDeg 4) simpleGrading (1 1 1.3)
hex (41 45 46 42 33 37 38 34) (5 $nDeg 4) simpleGrading (1 1 1.3)
hex (42 46 47 43 34 38 39 35) (5 $nDeg 4) simpleGrading (1 1 1.3)
hex (43 47 44 40 35 39 36 32) (5 $nDeg 4) simpleGrading (1 1 1.3)
hex (40 44 45 41 32 36 37 33) (5 $nDeg 4) simpleGrading (1 1 1.3)

);
edges
(
arc 2 1 (0.0 0.06    -0.2)
arc 1 0 (0.06 0.0    -0.2)
arc 0 3 (0.0 -0.06   -0.2)
arc 3 2 (-0.06 0.0   -0.2)
arc 6 5 (0.0 0.12    -0.2)
arc 5 4 (0.12 0.0    -0.2)
arc 4 7 (0.0 -0.12   -0.2)
arc 7 6 (-0.12 0.0   -0.2)
//---------------------------------
arc 10 9 (0.0 0.04    0.0)
arc 9 8 (0.04 0.0     0.0)
arc 8 11 (0.0 -0.04   0.0)
arc 11 10 (-0.04 0.0  0.0)
arc 14 13 (0.0 0.07    0.0)
arc 13 12 (0.07 0.0    0.0)
arc 12 15 (0.0 -0.07   0.0)
arc 15 14 (-0.07 0.0  0.0)
arc 18 17 (0.0 0.7071067812   0.0)
arc 17 16 (0.7071067812 0.0   0.0)
arc 16 19 (0.0 -0.7071067812  0.0)
arc 19 18 (-0.7071067812 0.0  0.0)
//--------------------------------
arc 22 21 (0.0 0.04    1.0)
arc 21 20 (0.04 0.0     1.0)
arc 20 23 (0.0 -0.04   1.0)
arc 23 22 (-0.04 0.0  1.0)
arc 26 25 (0.0 0.07    1.0)
arc 25 24 (0.07 0.0    1.0)
arc 24 27 (0.0 -0.07   1.0)
arc 27 26 (-0.07 0.0  1.0)
arc 30 29 (0.0 0.7071067812   1.0)
arc 29 28 (0.7071067812 0.0   1.0)
arc 28 31 (0.0 -0.7071067812  1.0)
arc 31 30 (-0.7071067812 0.0  1.0)
//----------------SPLINE----------
//spline 4 12( (0.081317279836453  -0.081317279836453   -0.15)  (0.063639610306789   -0.063639610306789    -0.05))
//spline 5 13( (0.081317279836453   0.081317279836453   -0.15)  (0.063639610306789    0.063639610306789    -0.05))
//spline 6 14((-0.081317279836453   0.081317279836453   -0.15) (-0.063639610306789    0.063639610306789    -0.05))
//spline 7 15((-0.081317279836453  -0.081317279836453   -0.15) (-0.063639610306789   -0.063639610306789    -0.05))
//spline 0 8( (0.040216698179985   -0.040216698179985    -0.15)  (0.033145630368119   -0.033145630368119    -0.05))
//spline 1 9( (0.040216698179985    0.040216698179985    -0.15)  (0.033145630368119    0.033145630368119    -0.05))
//spline 2 10((-0.040216698179985   0.040216698179985    -0.15) (-0.033145630368119    0.033145630368119    -0.05))
//spline 3 11((-0.040216698179985  -0.040216698179985    -0.15) (-0.033145630368119   -0.033145630368119    -0.05))
//-----------UP AREA--------------
arc 34 33 (0.0 $needleRadius    -0.7)
arc 33 32 ($needleRadius 0.0    -0.7)
arc 32 35 (0.0 $needleRadiusNeg   -0.7)
arc 35 34 ($needleRadiusNeg 0.0   -0.7)
arc 38 37 (0.0 0.62    -0.7)
arc 37 36 (0.62 0.0    -0.7)
arc 36 39 (0.0 -0.62   -0.7)
arc 39 38 (-0.62 0.0   -0.7)
//--------Piston----------------
arc 42 41 (0.0 $needleRadius    -0.8)
arc 41 40 ($needleRadius 0.0    -0.8)
arc 40 43 (0.0 $needleRadiusNeg   -0.8)
arc 43 42 ($needleRadiusNeg 0.0   -0.8)
arc 46 45 (0.0 0.72    -0.8)
arc 45 44 (0.72 0.0    -0.8)
arc 44 47 (0.0 -0.72   -0.8)
arc 47 46 (-0.72 0.0   -0.8)
);

boundary
(

	movingWall
    {
        type wall;
		faces
		(
			(32 35 34 33)
		);
	}
	outlet 
	{
		type patch; 
		faces
		(
			(13 14 18 17)
			(14 15 19 18)
			(15 12 16 19)
			(12 13 17 16)
			(17 18 30 29)
			(18 19 31 30)
			(19 16 28 31)
			(16 17 29 28)
		);
	}
	tank 
	{
		type wall; 
		faces
		(
			(20 21 22 23)
			(21 25 26 22)
			(22 26 27 23)
			(20 23 27 24)
			(20 24 25 21)
			(25 29 30 26)
			(26 30 31 27)
			(27 31 28 24)
			(24 28 29 25)
		);
	}
    pipe
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
			(7 4 12 15)
			//upper 45 degree slope
			(36 37 5 4)
			(37 38 6 5)
			(38 39 7 6)
			(39 36 4 7)
			(44 45 37 36)
			(45 46 38 37)
			(46 47 39 38)
			(47 44 36 39)
			
			(41 42 46 45)//oRing
			(42 43 47 46)
			(43 40 44 47)
			(40 41 45 44)
        );
    }
	farField
    {
        type patch;
        faces
        (
            (41 40 32 33)
            (40 43 35 32)
			(43 42 34 35)
			(42 41 33 34)
        );
    }
);
mergePatchPairs
(
);